# Taps
tap 'caskroom/cask'
tap 'buo/cask-upgrade' #cask for upgrade-cli
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Install Shells
brew 'zsh'

# Install GNU core utilities (those that come with macOS are outdated)
# Install some other useful utilities like `sponge`.
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'coreutils'
brew 'findutils'
brew 'moreutils'

# Install more recent versions of some macOS tools
brew 'grep'
brew 'openssh'
brew 'screen'

# Install Binaries
brew 'ack' # Better Search
brew 'awscli'
brew 'dark-mode' #Toggle Dark Mode from CLI
brew 'git'
brew 'git-lfs'
brew 'hub'#https://hub.github.com
brew 'lua'
brew 'mas'
brew 'mackup' # Backup App settings including dotfiles and others
brew 'mysql@5.7'
brew 'node'
brew 'p7zip'
brew 'php'
brew 'pv'
brew 'python'
brew 'python@2'
brew 'rename' # More powerful renamer
brew 'ruby'
brew 'testssl'
brew 'trash'
brew 'tree'
brew 'vbindiff'
brew 'wget'
brew 'zopfli'

#Install Package Managers
brew 'yarn'

# Apps
cask 'adobe-creative-cloud'
cask 'appcleaner'
cask 'atom'
cask 'battle-net'
cask 'cakebrew'
cask 'discord'
cask 'filebot'
cask 'firefox'
cask 'github'
cask 'gitter'
cask 'hyper'
cask 'iina'
cask 'imageoptim'
cask 'iterm2'
cask 'java'
cask 'jetbrains-toolbox'
cask 'keka'
cask 'mysqlworkbench'
cask 'parallels'
cask 'phpstorm'
cask 'plex-media-player'
cask 'sequel-pro'
cask 'steam'
cask 'tower'
cask 'transmission'
cask 'commander-one'
cask 'whatsapp'
cask 'visual-studio-code'
cask 'teamviewer'
cask 'openemu'
cask 'imagealpha'
cask 'cyberduck'
cask 'filezilla'
cask 'microsoft-office'
cask 'microsoft-teams'
cask 'telegram'
cask '1password'
cask 'jdownloader'
cask 'nomad'
cask 'origin'
cask 'istat-menus'


# Quicklook
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookase'
cask 'suspicious-package'
cask 'webpquicklook'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'


# Install Mac App Store apps
mas 'Amphetamine', id: 937984704
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Xcode', id: 497799835
mas 'Apple Configurator 2', id: 1037126344
mas 'Mactracker', id: 430255202
mas 'Outbank', id: 1094255754
mas 'Reeder', id: 1449412482
mas 'The Unarchiver', id: 425424353
